<template>
  <div class="section pb-6">
    <div class="container content">
      <h1 class="is-size-4">ContactApp Prototype</h1>

      <h2 class="is-size-5">Легенда</h2>
      <p>
        Фронтенд-інженери нашвидкоруч розробили прототип застосунку ContactApp, призначений для
        керування списком контактів підприємства, та вийшли у відпустку.
      </p>
      <p>
        Ви вирішили скористатися вільним робочим часом та довести прототип до ладу, щоб
        продемонструвати його директору підприємства і рухатися далі по проєкту.
      </p>
      <p>
        Вам треба привести прототип в належний вигляд, виправити баги та відрефакторити код - майте
        на увазі, що в майбутньому вам потрібно буде допрацьовувати, розширяти та підтримувати
        застосунок ContactApp.
      </p>

      <h2 class="is-size-5 mt-6">Технічне завдання, за яким було розроблено прототип</h2>

      <p>Розробити прототип застосунку списку контактів.</p>

      <p><strong>Дизайн</strong></p>
      <p>Без дизайну.</p>

      <p><strong>Користувальницькі історії</strong></p>

      <ol>
        <li>
          <p class="is-underlined">Список контактів</p>
          <p>
            <strong>
              <em>
                Як користувач, я хочу переглянути список доступних контактів посторінково,
                відсортувати та відфільтрувати його.
              </em>
            </strong>
          </p>
          <ul>
            <li>Посилання на цей розділ має бути завжди доступним</li>
            <li>
              Поля:<br />
              - повне ім'я контакту<br />
              - телефон<br />
              - відмітка "Співробітник підприємства", якщо контакт є співробітником
            </li>
            <li>
              Посторінковий перегляд: посилання на окремі сторінки, вперед, назад, на першу, на
              останню
            </li>
            <li>Сортування: за новизною, за ім'ям контакту</li>
            <li>Виводити фільтр "Показати тільки співробітників"</li>
          </ul>

          <p>
            <strong>
              <em> Як користувач, я хочу створити новий контакт. </em>
            </strong>
          </p>
          <ul>
            <li>
              Поля:<br />
              - ім'я * - текст<br />
              - прізвище * - текст<br />
              - по-батькові - текст<br />
              - телефон * - текст<br />
              - e-mail - текст<br />
            </li>
            <li>Виводити помилку, якщо сервер повернув щось окрім 200</li>
            <li>За необхідності, валідувати дані на стороні клієнта</li>
            <li>
              Після успішного створення контакту, перенаправляти користувача на сторінку цього
              контакту
            </li>
          </ul>
        </li>
        <li class="mt-4">
          <p class="is-underlined">Сторінка контакту</p>
          <p>
            <strong>
              <em> Як користувач, я хочу переглянути деталі контакту. </em>
            </strong>
          </p>
          <ul>
            <li>
              Поля:<br />
              - повне ім'я контакту<br />
              - телефон у форматі '+ххх...'<br />
              - e-mail (за наявності) - поле "Є співробітником: так \ ні"
            </li>
          </ul>

          <p>
            <strong>
              <em> Як користувач, я хочу відмітити контакт як співпрацівника підприємства. </em>
            </strong>
          </p>
          <ul>
            <li>Результат: поле "Є співробітником" має значення "так"</li>
          </ul>

          <p>
            <strong>
              <em>
                Як користувач, я хочу відмітити, що контакт не є співробітником підприємства.
              </em>
            </strong>
          </p>
          <ul>
            <li>Результат: поле "Є співробітником" має значення "ні"</li>
          </ul>

          <p>
            <strong>
              <em> Як користувач, я хочу видалити контакт. </em>
            </strong>
          </p>
          <ul>
            <li>Отримати підтверження перед видаленням</li>
            <li>Результат: контакт видалено зі списку</li>
            <li>
              Після успішного видалення, перенаправляти користувача на сторінку списку контактів
            </li>
          </ul>

          <p>
            <strong>
              <em> Як користувач, я хочу редагувати контакт. </em>
            </strong>
          </p>
          <ul>
            <li>
              Поля:<br />
              - ім'я * - текст <br />
              - прізвище * - текст <br />
              - по-батькові - текст<br />
              - e-mail - текст<br />
            </li>
            <li>Виводити помилку, якщо сервер повернув щось окрім 200</li>
            <li>За необхідності, валідувати дані на стороні клієнта</li>
            <li>Після успішного створення контакту, оновлювати поточну сторінку</li>
          </ul>
        </li>
      </ol>

      <h2 class="is-size-5 mt-6">Додаткова інформація</h2>

      <p>
        Застосунок написаний на <em>typescript</em>, фреймворк - <em>Vue.js 3</em>, бекенд -
        <em>Node.js</em>.
        <br />
        Для стилізації використана бібліотека утилітарних CSS класів
        <em>bulma.io</em>.
      </p>

      <p>
        Дані зберігаються в пам'яті, тож внесені в список контактів зміни будуть жити до кінця
        серверного сеансу. Щоб перестворити тестові дані, ви можете завершити сеанс та знов виконати
        команду
        <code>npm run dev</code>.
      </p>

      <h3 class="is-size-6">Доступний API</h3>
      <ul>
        <li><strong>GET</strong> <code>/api/contacts</code> - отримання списку контактів</li>
        <li><strong>POST</strong> <code>/api/contacts</code> - додавання нового контакту</li>
        <li><strong>GET</strong> <code>/api/contacts/:id</code> - отримання контакту за id</li>
        <li>
          <strong>PUT</strong>
          <code>/api/contacts/:id</code> - оновлення контакту
        </li>
        <li><strong>DELETE</strong> <code>/api/contacts/:id</code> - видалення контакту</li>
        <li>
          <strong>POST</strong>
          <code>/api/contacts/activate-employment</code> - відмітити контакт як співпрацівника
          підприємства
        </li>
        <li>
          <strong>POST</strong>
          <code>/api/contacts/deactivate-employment</code> - зняти з контакту мітку співпрацівника
          підприємства
        </li>
      </ul>

      <h3 class="is-size-6">Умови</h3>
      <p>Ви <strong>не можете змінювати</strong> папку <code>/src/server</code>.</p>
      <p>
        Ви <strong>можете</strong> вносити будь-які зміни в папку <code>/src/client</code> -
        видаляти та створювати папки, файли, встановлювати npm-пакети за необхідності.
      </p>
      <p>
        Вам <strong>не потрібно</strong> бути знайомим з CSS біблиотекою bulma.io - всі необхідні
        стильові правки можна зробити в <code>/src/client/styles</code>.
      </p>

      <h3 class="is-size-6">Очікувані результати</h3>
      <ul>
        <li>Код повинен бути зручно структурованим та читабельним</li>
        <li>
          Прототип повинен виглядати пристойно, бути повністю робочим та відповідати технічному
          завданню, наведеному вище
        </li>
        <li>В коді не повинно бути typescript помилок та попереджень</li>
        <li>Оскільки це прототип, коментарі в коді вітаються</li>
        <li>
          Якщо ви забажаєте будь-яким чином покращити UX або імплементувати не вказані в технічному
          завданні фічі, не забудьте прокоментувати такі зміни особливо детально
        </li>
        <li>Наявніть тестів користувацьких історій вітається, але не обов'язкова</li>
      </ul>
    </div>
  </div>
</template>
